Loc['bg'] = {
    dialog = {
        ['sell_amount'] = "Колко бихте искали да продадете?",
        ['amount'] = "Количество",
        ['specify_amount'] = "Посочете количество",
        ['all'] = "Всички",
        ['per_unit'] = 'за единица',
        ['sell_more'] = "Бихте ли искали да продадете още предмети?",
        ['yes'] = "Да, моля",
        ['no'] = "Не, благодаря!",
    },

    logs = {
        ['identifiers'] = "Идентификатори",
        ['id'] = "ID",
        ['character_name'] = "Име на героя",
        ['citizenid'] = "Граждански ID",
        ['license'] = "Лиценз",
        ['item_sold'] = "Продаден предмет",
        ['info'] = "Информация",
        ['item_reward_given'] = "Продаден предмет | Дадена предметна награда",
        ['item'] = "Предмет",
        ['amount'] = "Количество",
        ['money_reward'] = "Парична награда",
        ['dirty_money'] = "(Мръсни пари)",
        ['clean_money'] = "(Чисти пари)",
        ['amount_sold'] = "Продадено количество",
        ['item_given'] = "Даден предмет",
        ['amount_given'] = "Дадено количество",
        ['possible_exploit_attempt'] = "Възможен опит за експлойт",
        ['player_coords'] = "Координати на играча",
        ['near_shop'] = "Близо до магазин",
        ['shop_coords'] = "Координати на магазина",
    },

    error = {
        ['no_items_header'] = "Няма предмети за продажба",
        ['no_items_desc'] = "Нямате нищо у вас, което можете да продадете тук.",
        ['not_enough_cops'] = "Няма достатъчно полицаи",
        ['shop_closed'] = "Магазинът е затворен, заповядайте отново",
        ['not_enough'] = "Нямате достатъчно предмети за продажба",
    },

    info = {
        ["bulk_reward"] = "Получихте допълнително "..Config.CurrencySymbol.."%s за продажба на едро!",
    }
}