Loc['el'] = {
    dialog = {
        ['sell_amount'] = "Πόσα θα θέλατε να πουλήσετε;",
        ['amount'] = "Ποσότητα",
        ['specify_amount'] = "Καθορίστε μια ποσότητα",
        ['all'] = "Όλα",
        ['per_unit'] = 'ανά μονάδα',
        ['sell_more'] = "Θα θέλατε να πουλήσετε περισσότερα αντικείμενα;",
        ['yes'] = "Ναι, παρακαλώ",
        ['no'] = "Όχι, ευχαριστώ!",
    },

    logs = {
        ['identifiers'] = "Αναγνωριστικά",
        ['id'] = "ID",
        ['character_name'] = "Όνομα Χαρακτήρα",
        ['citizenid'] = "Αναγνωριστικό Πολίτη",
        ['license'] = "Άδεια",
        ['item_sold'] = "Αντικείμενο Πωλήθηκε",
        ['info'] = "Πληροφορίες",
        ['item_reward_given'] = "Αντικείμενο Πωλήθηκε | Ανταμοιβή Αντικειμένου Δόθηκε",
        ['item'] = "Αντικείμενο",
        ['amount'] = "Ποσότητα",
        ['money_reward'] = "Χρηματική Ανταμοιβή",
        ['dirty_money'] = "(Βρώμικα Χρήματα)",
        ['clean_money'] = "(Καθαρά Χρήματα)",
        ['amount_sold'] = "Ποσότητα που Πωλήθηκε",
        ['item_given'] = "Αντικείμενο που Δόθηκε",
        ['amount_given'] = "Ποσότητα που Δόθηκε",
        ['possible_exploit_attempt'] = "Πιθανή Απόπειρα Εκμετάλλευσης",
        ['player_coords'] = "Συντεταγμένες Παίκτη",
        ['near_shop'] = "Κοντά στο Κατάστημα",
        ['shop_coords'] = "Συντεταγμένες Καταστήματος",
    },

    error = {
        ['no_items_header'] = "Δεν υπάρχουν αντικείμενα προς πώληση",
        ['no_items_desc'] = "Δεν έχετε τίποτα πάνω σας που μπορείτε να πουλήσετε εδώ.",
        ['not_enough_cops'] = "Δεν υπάρχουν αρκετοί αστυνομικοί",
        ['shop_closed'] = "Το κατάστημα είναι κλειστό, ελάτε ξανά",
        ['not_enough'] = "Δεν έχετε αρκετά αντικείμενα για πώληση",
    },

    info = {
        ["bulk_reward"] = "Λάβατε επιπλέον "..Config.CurrencySymbol.."%s για πώληση σε μεγάλες ποσότητες!",
    }
}