Loc['fa'] = {
    dialog = {
        ['sell_amount'] = "چه تعداد می‌خواهید بفروشید؟",
        ['amount'] = "مقدار",
        ['specify_amount'] = "مقدار را مشخص کنید",
        ['all'] = "همه",
        ['per_unit'] = 'به ازای هر واحد',
        ['sell_more'] = "آیا می‌خواهید اقلام بیشتری بفروشید؟",
        ['yes'] = "بله، لطفاً",
        ['no'] = "نه، متشکرم!",
    },

    logs = {
        ['identifiers'] = "شناسه‌ها",
        ['id'] = "شناسه",
        ['character_name'] = "نام شخصیت",
        ['citizenid'] = "شناسه شهروندی",
        ['license'] = "مجوز",
        ['item_sold'] = "آیتم فروخته شده",
        ['info'] = "اطلاعات",
        ['item_reward_given'] = "آیتم فروخته شد | پاداش آیتم داده شد",
        ['item'] = "آیتم",
        ['amount'] = "مقدار",
        ['money_reward'] = "پاداش پولی",
        ['dirty_money'] = "(پول کثیف)",
        ['clean_money'] = "(پول تمیز)",
        ['amount_sold'] = "مقدار فروخته شده",
        ['item_given'] = "آیتم داده شده",
        ['amount_given'] = "مقدار داده شده",
        ['possible_exploit_attempt'] = "تلاش احتمالی برای سوء استفاده",
        ['player_coords'] = "مختصات بازیکن",
        ['near_shop'] = "نزدیک فروشگاه",
        ['shop_coords'] = "مختصات فروشگاه",
    },

    error = {
        ['no_items_header'] = "هیچ آیتمی برای فروش نیست",
        ['no_items_desc'] = "شما چیزی همراه خود ندارید که بتوانید اینجا بفروشید.",
        ['not_enough_cops'] = "پلیس کافی نیست",
        ['shop_closed'] = "فروشگاه بسته است، بازهم تشریف بیاورید",
        ['not_enough'] = "شما به اندازه کافی آیتم برای فروش ندارید",
    },

    info = {
        ["bulk_reward"] = "شما "..Config.CurrencySymbol.."%s اضافی برای فروش عمده دریافت کردید!",
    }
}