Loc['ru'] = {
    dialog = {
        ['sell_amount'] = "Сколько вы хотите продать?",
        ['amount'] = "Количество",
        ['specify_amount'] = "Укажите количество",
        ['all'] = "Все",
        ['per_unit'] = 'за единицу',
        ['sell_more'] = "Хотите продать еще предметы?",
        ['yes'] = "Да, пожалуйста",
        ['no'] = "Нет, спасибо!",
    },

    logs = {
        ['identifiers'] = "Идентификаторы",
        ['id'] = "ID",
        ['character_name'] = "Имя персонажа",
        ['citizenid'] = "ID гражданина",
        ['license'] = "Лицензия",
        ['item_sold'] = "Предмет продан",
        ['info'] = "Информация",
        ['item_reward_given'] = "Предмет продан | Выдана награда предметом",
        ['item'] = "Предмет",
        ['amount'] = "Количество",
        ['money_reward'] = "Денежная награда",
        ['dirty_money'] = "(Грязные деньги)",
        ['clean_money'] = "(Чистые деньги)",
        ['amount_sold'] = "Продано количество",
        ['item_given'] = "Выдан предмет",
        ['amount_given'] = "Выдано количество",
        ['possible_exploit_attempt'] = "Возможная попытка эксплойта",
        ['player_coords'] = "Координаты игрока",
        ['near_shop'] = "Рядом с магазином",
        ['shop_coords'] = "Координаты магазина",
    },

    error = {
        ['no_items_header'] = "Нет предметов для продажи",
        ['no_items_desc'] = "У вас нет ничего, что вы могли бы здесь продать.",
        ['not_enough_cops'] = "Недостаточно полицейских",
        ['shop_closed'] = "Магазин закрыт, приходите еще",
        ['not_enough'] = "У вас недостаточно предметов для продажи",
    },

    info = {
        ["bulk_reward"] = "Вы получили дополнительно "..Config.CurrencySymbol.."%s за оптовую продажу!",
    }
}