Loc['th'] = {
    dialog = {
        ['sell_amount'] = "คุณต้องการขายเท่าไหร่?",
        ['amount'] = "จำนวน",
        ['specify_amount'] = "ระบุจำนวน",
        ['all'] = "ทั้งหมด",
        ['per_unit'] = 'ต่อหน่วย',
        ['sell_more'] = "คุณต้องการขายสิ่งของเพิ่มเติมหรือไม่?",
        ['yes'] = "ใช่ ขอบคุณ",
        ['no'] = "ไม่ ขอบคุณ!",
    },

    logs = {
        ['identifiers'] = "ตัวระบุ",
        ['id'] = "ไอดี",
        ['character_name'] = "ชื่อตัวละคร",
        ['citizenid'] = "รหัสประชาชน",
        ['license'] = "ใบอนุญาต",
        ['item_sold'] = "ไอเทมที่ขาย",
        ['info'] = "ข้อมูล",
        ['item_reward_given'] = "ไอเทมที่ขาย | ได้รับรางวัลไอเทม",
        ['item'] = "ไอเทม",
        ['amount'] = "จำนวน",
        ['money_reward'] = "รางวัลเงิน",
        ['dirty_money'] = "(เงินผิดกฎหมาย)",
        ['clean_money'] = "(เงินสะอาด)",
        ['amount_sold'] = "จำนวนที่ขาย",
        ['item_given'] = "ไอเทมที่ได้รับ",
        ['amount_given'] = "จำนวนที่ได้รับ",
        ['possible_exploit_attempt'] = "ความพยายามในการใช้ประโยชน์ที่เป็นไปได้",
        ['player_coords'] = "พิกัดผู้เล่น",
        ['near_shop'] = "ใกล้ร้านค้า",
        ['shop_coords'] = "พิกัดร้านค้า",
    },

    error = {
        ['no_items_header'] = "ไม่มีไอเทมที่จะขาย",
        ['no_items_desc'] = "คุณไม่มีสิ่งของที่สามารถขายได้ที่นี่",
        ['not_enough_cops'] = "ตำรวจไม่เพียงพอ",
        ['shop_closed'] = "ร้านปิดแล้ว แล้วพบกันใหม่",
        ['not_enough'] = "คุณมีไอเทมไม่เพียงพอที่จะขาย",
    },

    info = {
        ["bulk_reward"] = "คุณได้รับโบนัสพิเศษ "..Config.CurrencySymbol.."%s จากการขายจำนวนมาก!",
    }
}