return {

    -- ⚠️ 警告: このスクリプトを操作するときは、決して "restart lation_diving" を行わないでください
    -- ⚠️ これにより、問題、データの損失などが発生します！スクリプトは次のように再起動する必要があります:
    -- ⚠️ "stop lation_diving" ..数秒待つ.. その後 "ensure lation_diving"

    ----------------------------------------------
    --        🛠️ 基本設定
    ----------------------------------------------

    setup = {
        -- 必要な場合にのみ使用し、サポートの指示があった場合、または何をしているかわかる場合に使用してください
        -- 注意: デバッグ機能を有効にすると、resmonが大幅に増加します
        -- 本番環境では常に無効にする必要があります
        debug = false,
        -- 以下のインタラクションシステムを設定してください
        -- 利用可能なオプション: 'ox_target', 'qb-target', 'interact' & 'custom'
        -- 'custom' は client/functions.lua に追加する必要があります
        -- また、さまざまなtextUIのサポートも提供しています: ox_lib, jg-textui, okokTextUI & qbcore
        -- 使用するtextUIを選択するには、client/functions.luaの3行目に移動してください
        interact = 'ox_target',
        -- 以下の通知システムを設定してください
        -- 利用可能なオプション: 'lation_ui', 'ox_lib', 'esx', 'qb', 'okok', 'sd-notify', 'wasabi_notify' & 'custom'
        -- 'custom' は client/functions.lua に追加する必要があります
        notify = 'lation_ui',
        -- 以下の進行状況バーシステムを設定してください
        -- 利用可能なオプション: 'lation_ui', 'ox_lib', 'qbcore' & 'custom'
        -- 'custom' は client/functions.lua に追加する必要があります
        -- カスタム進行状況バーもアニメーションをサポートしている必要があります
        progress = 'lation_ui',
        -- 以下のコンテキストメニューシステムを設定してください
        -- 利用可能なオプション: 'lation_ui', 'ox_lib' & 'custom'
        menu = 'lation_ui',
        -- 以下の通知と入力ダイアログシステムを設定してください
        -- 利用可能なオプション: 'lation_ui', 'ox_lib' & 'custom'
        dialogs = 'lation_ui',
        -- グループメニューでプレイヤー名を非表示にしますか？
        -- true の場合、名前の代わりにプレイヤーIDが表示されます
        -- false の場合、通常どおりキャラクター名が表示されます
        hideNames = false,
        -- 更新が利用可能な場合にサーバーコンソール経由で通知を受け取りますか？
        -- はいの場合は true、いいえの場合は false
        version = true,
        -- 必要に応じて、スキューバダイビングにジョブ要件を設定するオプションがあります
        -- 以下の false をジョブ名に変更するだけです。例: job = 'job_name'
        job = false,
        -- プレイヤーがダイビングしているとき、水中の現在の深さを確認できます。
        -- この深さをメートルまたはフィートで表示しますか？
        -- メートルの場合は metric を true に設定します。フィートの場合は metric を false に設定します。
        metric = true,
        -- ⚠️ 警告: サポートの指示がない限り、以下の数値を変更しないでください
        -- ⚠️ および/または何をしているのか理解してください - "SetPedMaxTimeUnderWater" の値
        max = 1800.0
    },

    ----------------------------------------------
    --       📍 アクティビティ開始設定
    ----------------------------------------------

    start = {
        -- ダイビングを開始するためのメインペッドをスポーンさせる場所
        -- 開始ペッドを無効にしたい場合は、coords = false に設定します
        coords = vec4(-289.3029, -2770.0029, 2.1953, 48.9145),
        -- 使用されるペッドモデル
        -- その他のモデル: https://docs.fivem.net/docs/game-references/ped-models/
        model = 's_m_y_shop_mask',
        -- ペッドに割り当てられたシナリオ（シナリオなしの場合は scenario = false）
        -- その他のシナリオ: https://github.com/DioneB/gtav-scenarios
        scenario = 'WORLD_HUMAN_CLIPBOARD',
        -- ここでペッドが利用可能な時間を制限できます
        -- デフォルトでは、このペッドは24時間365日利用可能です
        -- Min はペッドが利用可能になる最も早い時間（24時間形式）
        -- Max はペッドが利用可能になる最も遅い時間（24時間形式）
        -- たとえば、日中のみペッドを利用可能にしたい場合は、min = 6 & max = 21 に設定します
        hours = { min = 9, max = 21 },
        -- グループオーナーが「ダイビング開始」を選択したとき、マップ上の割り当てられた場所を受け取るまでにかかる時間
        -- （秒単位）
        cooldown = { min = 15, max = 30 },
        -- ダイビングの仕事が完了したとき、「ダイビングを続けますか？」を表示しますか？
        -- グループオーナーへのダイアログ？はいの場合は true、いいえの場合は false
        continue = true,
    },

    ----------------------------------------------
    --       📈 XPシステムのカスタマイズ
    ----------------------------------------------

    experience = {
        -- これらの [括弧] 内の数字はレベルです
        -- = の後の数字は、そのレベルに到達するために必要な経験値です
        -- レベルは *常に* 0 exp のレベル 1 から始まるようにしてください
        [1] = 0,
        [2] = 2500,
        [3] = 10000,
        [4] = 20000,
        [5] = 50000,
        -- 必要に応じてレベルを追加または削除できます
    },

    ----------------------------------------------
    --       🤿 スキューバギアのセットアップ
    ----------------------------------------------

    gear = {
        -- 利用可能なさまざまなスキューバギアタンクをカスタマイズ
        tanks = {
            -- [括弧] 内の数字は、このタンクを使用するために必要なレベルです
            -- item: 実際のスキューバタンクアイテムのスポーン名です
            -- degrade: 水中で10秒ごとにタンクがどれだけ劣化するかです
            -- レベル 1 は、補充が必要になるまで水中で約5分間持続します
            [1] = { item = 'ls_scuba_gear_1', degrade = 3.34 },
            -- レベル 2 は、補充が必要になるまで水中で約10分間持続します
            [2] = { item = 'ls_scuba_gear_2', degrade = 1.67 },
            -- レベル 3 は、補充が必要になるまで水中で約15分間持続します
            [3] = { item = 'ls_scuba_gear_3', degrade = 1.11 },
            -- レベル 4 は、補充が必要になるまで水中で約20分間持続します
            [4] = { item = 'ls_scuba_gear_4', degrade = 0.84 },
            -- レベル 5 は、補充が必要になるまで水中で約25分間持続します
            [5] = { item = 'ls_scuba_gear_5', degrade = 0.66 },
            -- 合計時間に基づいて劣化値を取得する式は次のとおりです:
            -- 100 ÷ (希望する合計時間（秒） ÷ 10) = degrade
        },
        -- 酸素補充タンクのアイテムスポーン名
        refill = 'ls_oxygen_tank',
        -- マスクはオブジェクトです、オブジェクトスポーン名:
        mask = 'p_d_scuba_mask_s',
        -- タンクはオブジェクトです、オブジェクトスポーン名:
        tank = 'p_s_scuba_tank_s',
        -- スキューバダイビング時に着用するオプションの服
        -- 服を着替えたくないですか？すべての drawableId を 0 に設定してください！
        -- ⚠️ componentId を変更しないでください
        clothes = {
            mask = {
                -- 設定したいコンポーネントID
                componentId = 1,
                -- 男性の drawableId と textureId
                male = { drawableId = 0, textureId = 0 },
                -- 女性の drawableId と textureId
                female = { drawableId = 0, textureId = 0 }
            },
            upperBody = {
                componentId = 3,
                male = { drawableId = 8, textureId = 0 },
                female = { drawableId = 3, textureId = 0 }
            },
            lowerBody = {
                componentId = 4,
                male = { drawableId = 94, textureId = 0 },
                female = { drawableId = 97, textureId = 0 }
            },
            bags = {
                componentId = 5,
                male = { drawableId = 0, textureId = 0 },
                female = { drawableId = 0, textureId = 0 }
            },
            shoes = {
                componentId = 6,
                male = { drawableId = 67, textureId = 0 },
                female = { drawableId = 70, textureId = 0 }
            },
            shirt = {
                componentId = 8,
                male = { drawableId = 15, textureId = 0 },
                female = { drawableId = 15, textureId = 0 }
            },
            bodyArmor = {
                componentId = 9,
                male = { drawableId = 0, textureId = 0 },
                female = { drawableId = 0, textureId = 0 }
            },
            decals = {
                componentId = 10,
                male = { drawableId = 0, textureId = 0 },
                female = { drawableId = 0, textureId = 0 }
            },
            jackets = {
                componentId = 11,
                male = { drawableId = 243, textureId = 0 },
                female = { drawableId = 251, textureId = 0 }
            }
        }
    },

    ----------------------------------------------
    --          🛒 ショップの設定
    ----------------------------------------------

    shop = {
        gear = {
            -- スキューバギアショップを有効にしますか？
            -- このショップはメインのダイビングメニューに追加されます
            enable = true,
            -- 購入に使用されるアカウント
            -- 利用可能なオプション: 'cash' または 'bank'
            account = 'cash',
            -- 購入可能なショップアイテム
            items = {
                -- item: アイテムのスポーン名
                -- price: アイテムの価格
                -- icon: アイテムのアイコン
                -- level: アイテムを購入するためのオプションのプレイヤーレベル要件
                -- metadata: 購入時に割り当てられるオプションの耐久性レベル
                -- metadata: ⚠️ 非メタデータアイテムを販売する場合は、このオプションを削除してください
                [1] = { item = 'ls_oxygen_tank', price = 1000, icon = 'fas fa-repeat', metadata = 100 },
                [2] = { item = 'ls_scuba_gear_1', price = 2500, icon = 'fas fa-lungs', level = 1, metadata = 100 },
                [3] = { item = 'ls_scuba_gear_2', price = 5000, icon = 'fas fa-lungs', level = 2, metadata = 100 },
                [4] = { item = 'ls_scuba_gear_3', price = 10000, icon = 'fas fa-lungs', level = 3, metadata = 100 },
                [5] = { item = 'ls_scuba_gear_4', price = 20000, icon = 'fas fa-lungs', level = 4, metadata = 100 },
                [6] = { item = 'ls_scuba_gear_5', price = 50000, icon = 'fas fa-lungs', level = 5, metadata = 100 },
                -- [7] = { item = 'burger', price = 5, icon = 'fas fa-burger' },
                -- [8] = { item = 'water', price = 5, icon = 'fas fa-glass-water' },
                -- 必要に応じてアイテムを追加または削除できます
            }
        },
        pawn = {
            -- スキューバギア質屋/売却ショップを有効にしますか？
            -- このショップはメインのダイビングメニューに追加されます
            enable = false,
            -- プレイヤーへの支払いに使用されるアカウント
            -- 利用可能なオプションは 'cash' または 'bank'
            account = 'cash',
            -- 売却可能なショップアイテム
            items = {
                -- item: アイテムのスポーン名
                -- price: アイテムの売却価格
                -- icon: アイテムのアイコン
                [1] = { item = 'ls_old_boot', price = 5, icon = 'fas fa-hand-holding-dollar' },
                [2] = { item = 'ls_wood_plank', price = 5, icon = 'fas fa-hand-holding-dollar' },
                [3] = { item = 'ls_rusted_padlock', price = 5, icon = 'fas fa-hand-holding-dollar' },
                [4] = { item = 'ls_rusted_key', price = 5, icon = 'fas fa-hand-holding-dollar' },
                [5] = { item = 'ls_rusted_gear', price = 5, icon = 'fas fa-hand-holding-dollar' },
                [6] = { item = 'ls_seashell', price = 15, icon = 'fas fa-hand-holding-dollar' },
                [7] = { item = 'ls_seaweed', price = 15, icon = 'fas fa-hand-holding-dollar' },
                [8] = { item = 'ls_rusted_muffler', price = 15, icon = 'fas fa-hand-holding-dollar' },
                [9] = { item = 'ls_broken_cd', price = 15, icon = 'fas fa-hand-holding-dollar' },
                [10] = { item = 'ls_diving_goggles', price = 15, icon = 'fas fa-hand-holding-dollar' },
                [11] = { item = 'ls_fishing_net', price = 25, icon = 'fas fa-hand-holding-dollar' },
                [12] = { item = 'ls_old_camera', price = 25, icon = 'fas fa-hand-holding-dollar' },
                [13] = { item = 'ls_military_helmet', price = 25, icon = 'fas fa-hand-holding-dollar' },
                [14] = { item = 'ls_old_compass', price = 50, icon = 'fas fa-hand-holding-dollar' },
                [15] = { item = 'ls_old_watch', price = 50, icon = 'fas fa-hand-holding-dollar' },
                [16] = { item = 'ls_conch_shell', price = 50, icon = 'fas fa-hand-holding-dollar' },
                -- 必要に応じてアイテムを追加または削除できます
            }
        }
    },

    ----------------------------------------------
    --       🛥️ ボートレンタルのカスタマイズ
    ----------------------------------------------

    rental = {
        -- ボートレンタルを提供しますか？
        enable = true,
        -- レンタルに使用されるアカウント
        -- 利用可能なオプション: 'cash' または 'bank'
        account = 'cash',
        -- ボートレンタルに支払いを要求しますか？
        -- いいえの場合、deposit = 0 に設定します
        deposit = 500,
        -- ボートが返却されたときにお金を返金しますか？
        -- いいえの場合、returnDeposit = 0 に設定します
        returnDeposit = 250,
        -- スクリプトは以下のリストからランダムなボートをスポーンします
        -- ボートを1つだけにしたい場合は、リストに1つだけ残してください
        models = { 'dinghy' },
        -- ボートがレンタルされたとき、プレイヤーをその中にテレポートさせますか？
        teleport = false,
        -- レンタルボートをどこにスポーンさせますか？
        coords = vec4(-291.7570, -2766.1208, 0.6787, 267.4251),
        -- ボートのアンカーオプションを追加しますか？
        anchor = true,
    },

    ----------------------------------------------
    --       ⛏️ ダイビングゾーンの構築
    ----------------------------------------------

    zones = {
        [1] = {
            -- このゾーンの中心位置
            location = vec3(1086.9691, -3575.9382, -50.1214),
            -- ここでスポーンする各木箱に対してランダムに選択されるモデル
            models = { 'xm3_prop_xm3_crate_supp_01a' },
            -- このゾーンの半径
            radius = 150.0,
            -- 近くにプレイヤーがいる場合の木箱のオプションのハイライト
            -- enable: true/false - 近くにいるときにハイライトを有効または無効にする
            -- distance: ハイライトが表示されるためにプレイヤーがどれだけ近くにいる必要があるか
            -- color: ハイライトの色 (https://rgbacolorpicker.com/) 
            highlight = { enable = false, distance = 30, color = { r = 106, g = 226, b = 119 } },
            -- このゾーンでスポーンできる木箱の数は？
            crates = { min = 2, max = 6 },
            -- このゾーンで見つかった木箱に対してどのくらいのXPが報酬として与えられますか？
            xp = { min = 1, max = 5 },
            -- 木箱がこのゾーン内でスポーンする正確な座標
            coords = {
                vec3(1094.7655, -3577.4995, -52.5339),
                vec3(1086.7635, -3537.7588, -43.1057),
                vec3(1106.2019, -3583.6062, -17.5417),
                vec3(1091.3970, -3618.1091, -44.4066),
                vec3(974.6331, -3567.4514, -47.2678),
                vec3(1161.8893, -3630.9204, -22.7693),
                vec3(1066.5341, -3559.0664, -20.8264),
                vec3(1138.0339, -3581.6411, -39.0230),
                vec3(1203.7281, -3524.0046, -33.9104),
                vec3(1191.8622, -3531.3965, -24.0956),
                vec3(1066.8358, -3485.3047, -32.4555),
                vec3(1034.0037, -3651.6384, -49.3254),
                vec3(1108.3530, -3662.9187, -41.3706),
                vec3(1180.6683, -3558.5405, -38.9220),
                vec3(1035.1763, -3586.1721, -45.7417),
                -- このゾーンからスポーンを追加または削除
            }
        },
        [2] = {
            location = vec3(3085.2043, -1853.3246, -14.3668),
            models = { 'xm3_prop_xm3_crate_supp_01a' },
            radius = 150.0,
            highlight = { enable = false, distance = 30, color = { r = 106, g = 226, b = 119 } },
            crates = { min = 2, max = 6 },
            xp = { min = 1, max = 5 },
            coords = {
                vec3(3085.2043, -1853.3246, -16.0565),
                vec3(3029.1843, -1820.8015, -24.6999),
                vec3(2993.0427, -1818.4943, -34.2077),
                vec3(2997.8711, -1753.7402, -11.0640),
                vec3(2982.0010, -1912.0287, -28.9325),
                vec3(3051.9775, -1926.9736, -54.6551),
                vec3(3011.4712, -1866.9753, -48.1732),
                vec3(3056.2656, -1761.5493, -43.3554),
                vec3(2950.1038, -1839.1633, -35.2352),
                vec3(3019.7561, -1913.2930, -32.4005),
                vec3(3061.5286, -1866.6348, -35.7668),
                vec3(3040.8525, -1879.8348, -57.6607),
                vec3(2974.8582, -1785.8473, -13.5562),
            }
        },
        [3] = {
            location = vec3(1818.7792, -2984.2068, -41.2811),
            models = { 'xm3_prop_xm3_crate_supp_01a' },
            radius = 150.0,
            highlight = { enable = false, distance = 30, color = { r = 106, g = 226, b = 119 } },
            crates = { min = 2, max = 6 },
            xp = { min = 1, max = 5 },
            coords = {
                vec3(1815.4813, -2981.9314, -42.1416),
                vec3(1820.6042, -2943.6421, -39.3650),
                vec3(1738.9772, -2948.8298, -23.5561),
                vec3(1732.7568, -3042.6794, -58.3799),
                vec3(1902.0460, -3026.5271, -45.4950),
                vec3(1760.1697, -2977.9131, -47.1564),
                vec3(1760.2402, -3093.1196, -66.6896),
                vec3(1820.7825, -3068.2268, -39.7288),
                vec3(1929.2610, -2969.8464, -36.5976),
                vec3(1777.1892, -2915.6821, -30.6168),
                vec3(1709.7538, -2952.2861, -24.4798),
                vec3(1849.2987, -2965.3936, -52.7471),
                vec3(1891.3480, -2918.0266, -22.7276),
            }
        },
        [4] = {
            location = vec3(3150.8074, -973.6499, -26.9572),
            models = { 'xm3_prop_xm3_crate_supp_01a' },
            radius = 150.0,
            highlight = { enable = false, distance = 30, color = { r = 106, g = 226, b = 119 } },
            crates = { min = 2, max = 6 },
            xp = { min = 1, max = 5 },
            coords = {
                vec3(3150.8074, -973.6499, -26.9572),
                vec3(3132.8245, -1026.0867, -42.3399),
                vec3(3085.2126, -970.5078, -17.9598),
                vec3(3088.5186, -859.4744, -36.9759),
                vec3(3129.6709, -944.6890, -39.5992),
                vec3(3191.7087, -984.1827, -21.3900),
                vec3(3112.4922, -1061.3378, -47.8674),
                vec3(3089.1252, -1030.5328, -43.6450),
                vec3(3050.0190, -946.1809, -23.7141),
                vec3(3184.7986, -870.0077, -65.7725),
                vec3(3125.7749, -890.1265, -43.6622),
                vec3(3075.5540, -898.0163, -22.6175),
            }
        },
        [5] = {
            location = vec3(2383.6611, -2451.3289, -32.9255),
            models = { 'xm3_prop_xm3_crate_supp_01a' },
            radius = 150.0,
            highlight = { enable = false, distance = 30, color = { r = 106, g = 226, b = 119 } },
            crates = { min = 2, max = 6 },
            xp = { min = 1, max = 5 },
            coords = {
                vec3(2383.6611, -2451.3289, -32.9255),
                vec3(2437.7466, -2411.5706, -32.8800),
                vec3(2385.5486, -2347.8923, -16.6751),
                vec3(2313.7725, -2344.6472, -8.4371),
                vec3(2270.5879, -2393.7388, -26.9309),
                vec3(2299.5146, -2433.6165, -19.7982),
                vec3(2301.1694, -2404.3206, -25.4087),
                vec3(2393.1316, -2410.4976, -32.1512),
                vec3(2353.0732, -2517.1201, -29.7120),
                vec3(2442.2646, -2456.6064, -7.9306),

            }
        },
        [6] = {
            location = vec3(280.3442, -3492.5969, -29.2227),
            models = { 'xm3_prop_xm3_crate_supp_01a' },
            radius = 150.0,
            highlight = { enable = false, distance = 30, color = { r = 106, g = 226, b = 119 } },
            crates = { min = 2, max = 6 },
            xp = { min = 1, max = 5 },
            coords = {
                vec3(280.3442, -3492.5969, -29.2227),
                vec3(361.8796, -3468.6265, -26.7427),
                vec3(313.8169, -3376.5999, -24.5615),
                vec3(214.2739, -3467.3735, -14.0912),
                vec3(230.4904, -3558.5493, -50.8256),
                vec3(229.1392, -3405.6541, -19.9491),
                vec3(263.5007, -3446.9626, -25.7515),
                vec3(332.7290, -3455.4980, -28.1874),
                vec3(260.9624, -3362.8247, -18.8871),
                vec3(183.2011, -3419.6165, -18.7913),
            }
        },
        [7] = {
            location = vec3(-2080.0508, -876.7839, -38.1838),
            models = { 'xm3_prop_xm3_crate_supp_01a' },
            radius = 150.0,
            highlight = { enable = false, distance = 30, color = { r = 106, g = 226, b = 119 } },
            crates = { min = 2, max = 6 },
            xp = { min = 1, max = 5 },
            coords = {
                vec3(-2080.0508, -876.7839, -38.1838),
                vec3(-2013.5044, -984.5208, -15.5007),
                vec3(-2169.8203, -962.9402, -70.6583),
                vec3(-2081.6479, -939.0807, -40.9644),
                vec3(-2142.8997, -880.9988, -38.1233),
                vec3(-2051.6763, -874.8913, -4.9137),
                vec3(-2060.8647, -843.3949, -24.2824),
                vec3(-2101.0276, -856.7371, -32.4969),
                vec3(-2187.1812, -831.8537, -36.8464),
                vec3(-2090.7273, -1001.5419, -43.5531),
                vec3(-2000.4624, -917.0707, -14.9745),
                vec3(-2035.0875, -833.5734, -14.8460),
                vec3(-2041.9478, -818.1243, -5.5512),
                vec3(-2161.8516, -776.5375, -22.6451),
                vec3(-2142.2932, -839.6798, -32.2059),
                vec3(-2049.0518, -920.3878, -32.7276),
            }
        },
        [8] = {
            location = vec3(-2837.9504, -494.8672, -45.7883),
            models = { 'xm3_prop_xm3_crate_supp_01a' },
            radius = 150.0,
            highlight = { enable = false, distance = 30, color = { r = 106, g = 226, b = 119 } },
            crates = { min = 2, max = 6 },
            xp = { min = 1, max = 5 },
            coords = {
                vec3(-2837.9504, -494.8672, -45.7883),
                vec3(-2789.4587, -623.3177, -47.6618),
                vec3(-2854.2878, -578.2092, -75.3579),
                vec3(-2836.2771, -528.2178, -66.3296),
                vec3(-2814.6587, -561.5555, -71.3785),
                vec3(-2749.4819, -543.8317, -46.9659),
                vec3(-2749.5925, -462.8193, -37.6869),
                vec3(-2833.0474, -462.1175, -18.8996),
                vec3(-2921.6694, -434.5992, -37.3384),
                vec3(-2819.7563, -591.3509, -58.2769),
                vec3(-2760.0801, -581.4194, -47.1628),
                vec3(-2808.8740, -409.1779, -38.3897),
                vec3(-2847.6389, -380.1435, -40.4797),
                vec3(-2881.4072, -439.8226, -38.2622),
                vec3(-2785.4697, -524.0317, -54.6307),
            }
        },
        [9] = {
            location = vec3(-3550.5359, 646.9001, -66.3281),
            models = { 'xm3_prop_xm3_crate_supp_01a' },
            radius = 150.0,
            highlight = { enable = false, distance = 30, color = { r = 106, g = 226, b = 119 } },
            crates = { min = 2, max = 6 },
            xp = { min = 1, max = 5 },
            coords = {
                vec3(-3550.5359, 646.9001, -66.3281),
                vec3(-3562.6257, 622.5925, -31.0750),
                vec3(-3514.4497, 629.0671, -31.9019),
                vec3(-3464.5229, 618.9487, -39.9314),
                vec3(-3468.6663, 546.3879, -46.4398),
                vec3(-3532.4519, 540.3656, -55.3767),
                vec3(-3576.2854, 742.5957, -47.0631),
                vec3(-3530.5144, 767.2094, -36.7547),
                vec3(-3489.9067, 699.1218, -50.1850),
                vec3(-3503.2341, 591.9188, -46.4599),
                vec3(-3589.1309, 596.7454, -61.6465),
                vec3(-3594.2913, 689.3352, -64.4904),
            }
        },
        [10] = {
            location = vec3(-3416.8613, 1701.7200, -61.6626),
            models = { 'xm3_prop_xm3_crate_supp_01a' },
            radius = 150.0,
            highlight = { enable = false, distance = 30, color = { r = 106, g = 226, b = 119 } },
            crates = { min = 2, max = 6 },
            xp = { min = 1, max = 5 },
            coords = {
                vec3(-3416.8613, 1701.7200, -61.6626),
                vec3(-3417.9424, 1653.9034, -42.2417),
                vec3(-3410.1980, 1589.5227, -42.9441),
                vec3(-3303.7632, 1705.6891, -23.4423),
                vec3(-3494.1262, 1706.0807, -65.6907),
                vec3(-3465.9348, 1698.5503, -45.7951),
                vec3(-3372.7073, 1669.8127, -45.0799),
                vec3(-3331.2153, 1686.3544, -42.6237),
                vec3(-3406.0732, 1780.2509, -37.4121),
                vec3(-3450.4163, 1663.0955, -40.5404),
                vec3(-3336.1089, 1611.4885, -40.8837),
            }
        }
    },

    ----------------------------------------------
    --       📦 木箱のカスタマイズ
    ----------------------------------------------

    crates = {
        -- 木箱のアイテムスポーン名
        item = 'ls_diving_crate',
        -- 拾ったときにプレイヤーに与えられる木箱の数
        quantity = { min = 1, max = 1 },
        -- 木箱を開けたときの戦利品テーブル
        -- ⚠️ この戦利品テーブルの仕組みは非常にユニークです - 読んでください :)
        -- ⚠️ [括弧] 内の各数字は、その戦利品を得るチャンスを得るために必要なレベルです
        -- ⚠️ 各アイテムは個別にロールされるため、1つの木箱から複数のアイテムを取得できます
        -- ⚠️ ダイビングレベルが1の場合、セクション [1] のアイテムのチャンスのみが得られます
        -- ⚠️ ダイビングレベルが3の場合、セクション [1] から [3] のアイテムのチャンスが得られます
        -- ⚠️ これにより、プレイヤーのダイビング経験に基づいて報酬をスケーリングする機能が得られます
        -- ⚠️ このセクションは、特定のサーバーとアイテムに合わせてあなたが構築することを目的としています
        -- ⚠️ 開始するのに役立ついくつかのフィラーアイテムを含むベース戦利品テーブルのみを提供します
        loot = {
            [1] = {
                -- これらのアイテムは、レベル1以上のプレイヤーに対してのみロールされます
                -- item: スポーン名 | quantity = 最小/最大 | chance = 1-100 | metadata (オプション): {key = value}
                { item = 'ls_old_boot', quantity = { min = 1, max = 1 }, chance = 100 },
                { item = 'ls_wood_plank', quantity = { min = 1, max = 1 }, chance = 80 },
                { item = 'ls_rusted_padlock', quantity = { min = 1, max = 1 }, chance = 60 },
                { item = 'ls_rusted_key', quantity = { min = 1, max = 1 }, chance = 40 },
                { item = 'ls_rusted_gear', quantity = { min = 1, max = 1 }, chance = 30 },
                { item = 'ls_seashell', quantity = { min = 1, max = 1 }, chance = 30 },
                { item = 'ls_seaweed', quantity = { min = 1, max = 1 }, chance = 25 },
                { item = 'ls_rusted_muffler', quantity = { min = 1, max = 1 }, chance = 25 },
                { item = 'ls_broken_cd', quantity = { min = 1, max = 1 }, chance = 20 },
                { item = 'ls_diving_goggles', quantity = { min = 1, max = 1 }, chance = 20 },
                { item = 'ls_fishing_net', quantity = { min = 1, max = 1 }, chance = 15 },
                { item = 'ls_old_camera', quantity = { min = 1, max = 1 }, chance = 15 },
                { item = 'ls_military_helmet', quantity = { min = 1, max = 1 }, chance = 10 },
                { item = 'ls_old_compass', quantity = { min = 1, max = 1 }, chance = 10 },
                { item = 'ls_old_watch', quantity = { min = 1, max = 1 }, chance = 5 },
                { item = 'ls_conch_shell', quantity = { min = 1, max = 1 }, chance = 5 },
                -- 必要に応じてアイテムを追加または削除できます
            },
            [2] = {
                -- これらのアイテムは、レベル2以上のプレイヤーに対してのみロールされます
                { item = 'ls_bottle_of_rum', quantity = { min = 1, max = 1 }, chance = 50 },
            },
            [3] = {
                -- これらのアイテムは、レベル3以上のプレイヤーに対してのみロールされます
                { item = 'ls_treasure_map', quantity = { min = 1, max = 1 }, chance = 50 },
            },
            [4] = {
                -- これらのアイテムは、レベル4以上のプレイヤーに対してのみロールされます
                { item = 'ls_silver_bracelet', quantity = { min = 1, max = 1 }, chance = 50 },
            },
            [5] = {
                -- これらのアイテムは、レベル5以上のプレイヤーに対してのみロールされます
                { item = 'ls_ancient_artifact', quantity = { min = 1, max = 1 }, chance = 50 },
            }
        }
    }

}